OpenFOAM-master/of-xp/OpenFOAM-2.3.1/tutorials/compressible/rhoSimpleFoam/angledDuctExplicitFixedCoeff/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

m4 constant/polyMesh/blockMeshDict.m4 > constant/polyMesh/blockMeshDict

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

runApplication blockMesh
runApplication $application

# ----------------------------------------------------------------- end-of-file
